7767517
277 301
Input                    input                    0 1 input
Convolution              conv_63                  1 1 input 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
ConvolutionDepthWise     convdw_123               1 1 1 2 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16
BinaryOp                 mul_0                    1 1 2 3 0=2 1=1 2=1.2126
BinaryOp                 add_1                    1 1 3 4 0=0 1=1 2=0.46886
HardSwish                hswish_20                1 1 4 5 0=0.166667 1=0.5
BinaryOp                 mul_2                    1 1 5 6 0=2 1=1 2=0.00523472
BinaryOp                 add_3                    1 1 6 7 0=0 1=1 2=0.000237282
Convolution              conv_64                  1 1 7 8 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
BinaryOp                 mul_4                    1 1 8 9 0=2 1=1 2=1.88755
BinaryOp                 add_5                    1 1 9 10 0=0 1=1 2=0.718749
HardSwish                hswish_21                1 1 10 11 0=0.166667 1=0.5
BinaryOp                 mul_6                    1 1 11 12 0=2 1=1 2=0.677513
BinaryOp                 add_7                    1 1 12 13 0=0 1=1 2=-0.229148
ConvolutionDepthWise     convdw_124               1 1 13 14 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=288 7=32
BinaryOp                 mul_8                    1 1 14 15 0=2 1=1 2=0.00517491
BinaryOp                 add_9                    1 1 15 16 0=0 1=1 2=0.000369573
Convolution              conv_65                  1 1 16 17 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
BinaryOp                 mul_10                   1 1 17 18 0=2 1=1 2=0.882177
BinaryOp                 add_11                   1 1 18 19 0=0 1=1 2=1.72146
HardSwish                hswish_22                1 1 19 20 0=0.166667 1=0.5
BinaryOp                 mul_12                   1 1 20 21 0=2 1=1 2=0.367713
BinaryOp                 add_13                   1 1 21 22 0=0 1=1 2=-0.871138
ConvolutionDepthWise     convdw_125               1 1 22 23 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
BinaryOp                 mul_14                   1 1 23 24 0=2 1=1 2=2.4128
BinaryOp                 add_15                   1 1 24 25 0=0 1=1 2=0.39553
HardSwish                hswish_23                1 1 25 26 0=0.166667 1=0.5
BinaryOp                 mul_16                   1 1 26 27 0=2 1=1 2=0.00590227
BinaryOp                 add_17                   1 1 27 28 0=0 1=1 2=-3.078864e-05
Convolution              conv_66                  1 1 28 29 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
BinaryOp                 mul_18                   1 1 29 30 0=2 1=1 2=1.33334
BinaryOp                 add_19                   1 1 30 31 0=0 1=1 2=0.855694
HardSwish                hswish_24                1 1 31 32 0=0.166667 1=0.5
BinaryOp                 mul_20                   1 1 32 33 0=2 1=1 2=1.49892
BinaryOp                 add_21                   1 1 33 34 0=0 1=1 2=-0.555021
Split                    splitncnn_0              1 2 34 35 36
ConvolutionDepthWise     convdw_126               1 1 36 37 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 7=48
BinaryOp                 mul_22                   1 1 37 38 0=2 1=1 2=0.00354538
BinaryOp                 add_23                   1 1 38 39 0=0 1=1 2=-0.000263411
Convolution              conv_67                  1 1 39 40 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
BinaryOp                 mul_24                   1 1 40 41 0=2 1=1 2=0.611824
BinaryOp                 add_25                   1 1 41 42 0=0 1=1 2=1.89251
HardSwish                hswish_25                1 1 42 43 0=0.166667 1=0.5
BinaryOp                 mul_26                   1 1 43 44 0=2 1=1 2=0.558389
BinaryOp                 add_27                   1 1 44 45 0=0 1=1 2=-0.95102
ConvolutionDepthWise     convdw_127               1 1 45 46 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
BinaryOp                 mul_28                   1 1 46 47 0=2 1=1 2=1.17258
BinaryOp                 add_29                   1 1 47 48 0=0 1=1 2=0.541325
HardSwish                hswish_26                1 1 48 49 0=0.166667 1=0.5
BinaryOp                 mul_30                   1 1 49 50 0=2 1=1 2=0.0967831
BinaryOp                 add_31                   1 1 50 51 0=0 1=1 2=2.480455e-05
Convolution              conv_68                  1 1 51 52 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
BinaryOp                 mul_32                   1 1 52 53 0=2 1=1 2=0.908592
BinaryOp                 add_33                   1 1 53 54 0=0 1=1 2=-0.0670728
HardSwish                hswish_27                1 1 54 55 0=0.166667 1=0.5
BinaryOp                 mul_34                   1 1 55 56 0=2 1=1 2=1.54173
BinaryOp                 add_35                   1 1 56 57 0=0 1=1 2=-0.0574839
Split                    splitncnn_1              1 2 57 58 59
ConvolutionDepthWise     convdw_128               1 1 59 60 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 7=96
BinaryOp                 mul_36                   1 1 60 61 0=2 1=1 2=0.00251429
BinaryOp                 add_37                   1 1 61 62 0=0 1=1 2=0.000520503
Convolution              conv_69                  1 1 62 63 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
BinaryOp                 mul_38                   1 1 63 64 0=2 1=1 2=0.778889
BinaryOp                 add_39                   1 1 64 65 0=0 1=1 2=1.38154
HardSwish                hswish_28                1 1 65 66 0=0.166667 1=0.5
BinaryOp                 mul_40                   1 1 66 67 0=2 1=1 2=0.653882
BinaryOp                 add_41                   1 1 67 68 0=0 1=1 2=-0.815451
ConvolutionDepthWise     convdw_129               1 1 68 69 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192
BinaryOp                 mul_42                   1 1 69 70 0=2 1=1 2=1.06083
BinaryOp                 add_43                   1 1 70 71 0=0 1=1 2=0.365644
HardSwish                hswish_29                1 1 71 72 0=0.166667 1=0.5
BinaryOp                 mul_44                   1 1 72 73 0=2 1=1 2=0.00462354
BinaryOp                 add_45                   1 1 73 74 0=0 1=1 2=0.000703441
Convolution              conv_70                  1 1 74 75 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
BinaryOp                 mul_46                   1 1 75 76 0=2 1=1 2=1.12273
BinaryOp                 add_47                   1 1 76 77 0=0 1=1 2=0.467123
HardSwish                hswish_30                1 1 77 78 0=0.166667 1=0.5
BinaryOp                 mul_48                   1 1 78 79 0=2 1=1 2=0.790457
BinaryOp                 add_49                   1 1 79 80 0=0 1=1 2=-0.113252
ConvolutionDepthWise     convdw_130               1 1 80 81 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192
BinaryOp                 mul_50                   1 1 81 82 0=2 1=1 2=1.07921
BinaryOp                 add_51                   1 1 82 83 0=0 1=1 2=0.895926
HardSwish                hswish_31                1 1 83 84 0=0.166667 1=0.5
BinaryOp                 mul_52                   1 1 84 85 0=2 1=1 2=0.0269234
BinaryOp                 add_53                   1 1 85 86 0=0 1=1 2=-0.000272939
Convolution              conv_71                  1 1 86 87 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
BinaryOp                 mul_54                   1 1 87 88 0=2 1=1 2=1.02658
BinaryOp                 add_55                   1 1 88 89 0=0 1=1 2=0.0792048
HardSwish                hswish_32                1 1 89 90 0=0.166667 1=0.5
BinaryOp                 mul_56                   1 1 90 91 0=2 1=1 2=0.729764
BinaryOp                 add_57                   1 1 91 92 0=0 1=1 2=0.0485918
ConvolutionDepthWise     convdw_131               1 1 92 93 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192
BinaryOp                 mul_58                   1 1 93 94 0=2 1=1 2=0.908857
BinaryOp                 add_59                   1 1 94 95 0=0 1=1 2=0.894915
HardSwish                hswish_33                1 1 95 96 0=0.166667 1=0.5
BinaryOp                 mul_60                   1 1 96 97 0=2 1=1 2=0.00505481
BinaryOp                 add_61                   1 1 97 98 0=0 1=1 2=0.000966824
Convolution              conv_72                  1 1 98 99 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
BinaryOp                 mul_62                   1 1 99 100 0=2 1=1 2=1.16184
BinaryOp                 add_63                   1 1 100 101 0=0 1=1 2=-0.0963788
HardSwish                hswish_34                1 1 101 102 0=0.166667 1=0.5
BinaryOp                 mul_64                   1 1 102 103 0=2 1=1 2=0.821648
BinaryOp                 add_65                   1 1 103 104 0=0 1=1 2=0.177517
ConvolutionDepthWise     convdw_132               1 1 104 105 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192
BinaryOp                 mul_66                   1 1 105 106 0=2 1=1 2=0.876167
BinaryOp                 add_67                   1 1 106 107 0=0 1=1 2=1.14574
HardSwish                hswish_35                1 1 107 108 0=0.166667 1=0.5
BinaryOp                 mul_68                   1 1 108 109 0=2 1=1 2=0.00791641
BinaryOp                 add_69                   1 1 109 110 0=0 1=1 2=0.000933445
Convolution              conv_73                  1 1 110 111 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
BinaryOp                 mul_70                   1 1 111 112 0=2 1=1 2=0.891313
BinaryOp                 add_71                   1 1 112 113 0=0 1=1 2=-0.904133
HardSwish                hswish_36                1 1 113 114 0=0.166667 1=0.5
BinaryOp                 mul_72                   1 1 114 115 0=2 1=1 2=1.36137
BinaryOp                 add_73                   1 1 115 116 0=0 1=1 2=0.18225
Split                    splitncnn_2              1 2 116 117 118
ConvolutionDepthWise     convdw_133               1 1 118 119 0=192 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=4800 7=192
BinaryOp                 mul_74                   1 1 119 120 0=2 1=1 2=0.703518
BinaryOp                 add_75                   1 1 120 121 0=0 1=1 2=-0.0966372
Split                    splitncnn_3              1 2 121 122 123
Pooling                  gap_0                    1 1 123 124 0=1 4=1
Convolution              convrelu_0               1 1 124 125 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Convolution              conv_75                  1 1 125 126 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSigmoid              hsigmoid_10              1 1 126 127 0=0.166667 1=0.5
Reshape                  reshape_113              1 1 127 128 0=1 1=1 2=-1
BinaryOp                 mul_76                   2 1 122 128 129 0=2
Convolution              conv_76                  1 1 129 130 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
BinaryOp                 mul_77                   1 1 130 131 0=2 1=1 2=1.1775
BinaryOp                 add_78                   1 1 131 132 0=0 1=1 2=0.0251325
HardSwish                hswish_37                1 1 132 133 0=0.166667 1=0.5
BinaryOp                 mul_79                   1 1 133 134 0=2 1=1 2=0.967964
BinaryOp                 add_80                   1 1 134 135 0=0 1=1 2=0.137993
ConvolutionDepthWise     convdw_134               1 1 135 136 0=384 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=9600 7=384
BinaryOp                 mul_81                   1 1 136 137 0=2 1=1 2=1.55538
BinaryOp                 add_82                   1 1 137 138 0=0 1=1 2=0.833365
HardSwish                hswish_38                1 1 138 139 0=0.166667 1=0.5
BinaryOp                 mul_83                   1 1 139 140 0=2 1=1 2=1.25352
BinaryOp                 add_84                   1 1 140 141 0=0 1=1 2=-1.03515
Split                    splitncnn_4              1 2 141 142 143
Pooling                  gap_1                    1 1 143 144 0=1 4=1
Convolution              convrelu_1               1 1 144 145 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864 9=1
Convolution              conv_78                  1 1 145 146 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
HardSigmoid              hsigmoid_11              1 1 146 147 0=0.166667 1=0.5
Reshape                  reshape_114              1 1 147 148 0=1 1=1 2=-1
BinaryOp                 mul_85                   2 1 142 148 149 0=2
Convolution              conv_79                  1 1 149 150 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
BinaryOp                 mul_86                   1 1 150 151 0=2 1=1 2=0.875972
BinaryOp                 add_87                   1 1 151 152 0=0 1=1 2=-0.535566
HardSwish                hswish_39                1 1 152 153 0=0.166667 1=0.5
BinaryOp                 mul_88                   1 1 153 154 0=2 1=1 2=0.919406
BinaryOp                 add_89                   1 1 154 155 0=0 1=1 2=0.258226
ConvolutionDepthWise     convdw_135               1 1 155 156 0=384 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=9600 7=384
BinaryOp                 mul_90                   1 1 156 157 0=2 1=1 2=0.946459
BinaryOp                 add_91                   1 1 157 158 0=0 1=1 2=0.709349
HardSwish                hswish_40                1 1 158 159 0=0.166667 1=0.5
BinaryOp                 mul_92                   1 1 159 160 0=2 1=1 2=0.146162
BinaryOp                 add_93                   1 1 160 161 0=0 1=1 2=-0.000106434
Convolution              conv_80                  1 1 161 162 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
BinaryOp                 mul_94                   1 1 162 163 0=2 1=1 2=0.904013
BinaryOp                 add_95                   1 1 163 164 0=0 1=1 2=-0.294733
HardSwish                hswish_41                1 1 164 165 0=0.166667 1=0.5
BinaryOp                 mul_96                   1 1 165 166 0=2 1=1 2=0.935939
BinaryOp                 add_97                   1 1 166 167 0=0 1=1 2=0.165901
ConvolutionDepthWise     convdw_136               1 1 167 168 0=384 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=9600 7=384
BinaryOp                 mul_98                   1 1 168 169 0=2 1=1 2=1.01925
BinaryOp                 add_99                   1 1 169 170 0=0 1=1 2=0.408163
HardSwish                hswish_42                1 1 170 171 0=0.166667 1=0.5
BinaryOp                 mul_100                  1 1 171 172 0=2 1=1 2=0.169525
BinaryOp                 add_101                  1 1 172 173 0=0 1=1 2=-6.227764e-05
Convolution              conv_81                  1 1 173 174 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
BinaryOp                 mul_102                  1 1 174 175 0=2 1=1 2=0.62516
BinaryOp                 add_103                  1 1 175 176 0=0 1=1 2=-1.13659
HardSwish                hswish_43                1 1 176 177 0=0.166667 1=0.5
BinaryOp                 mul_104                  1 1 177 178 0=2 1=1 2=4.53756
BinaryOp                 add_105                  1 1 178 179 0=0 1=1 2=1.28809
Convolution              conv_82                  1 1 35 180 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
Convolution              conv_83                  1 1 58 181 0=18 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1728
Convolution              conv_84                  1 1 117 182 0=42 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8064
Convolution              conv_85                  1 1 179 183 0=360 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=138240
Convolution              conv_86                  1 1 183 184 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=34560
Split                    splitncnn_5              1 3 184 185 186 187
Pooling                  gap_2                    1 1 187 188 0=1 4=1
Convolution              convrelu_2               1 1 188 189 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              conv_88                  1 1 189 190 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Reshape                  reshape_115              1 1 190 191 0=1 1=1 2=-1
BinaryOp                 mul_106                  1 1 191 192 0=2 1=1 2=1.2
HardSigmoid              hsigmoid_12              1 1 192 193 0=0.166667 1=0.5
BinaryOp                 mul_107                  2 1 185 193 194 0=2
BinaryOp                 add_108                  2 1 186 194 195 0=0
Split                    splitncnn_6              1 2 195 196 197
Convolution              conv_89                  1 1 182 198 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=4032
Split                    splitncnn_7              1 3 198 199 200 201
Pooling                  gap_3                    1 1 201 202 0=1 4=1
Convolution              convrelu_3               1 1 202 203 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              conv_91                  1 1 203 204 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Reshape                  reshape_116              1 1 204 205 0=1 1=1 2=-1
BinaryOp                 mul_109                  1 1 205 206 0=2 1=1 2=1.2
HardSigmoid              hsigmoid_13              1 1 206 207 0=0.166667 1=0.5
Convolution              conv_92                  1 1 181 208 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1728
Split                    splitncnn_8              1 3 208 209 210 211
Pooling                  gap_4                    1 1 211 212 0=1 4=1
Convolution              convrelu_4               1 1 212 213 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              conv_94                  1 1 213 214 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Reshape                  reshape_117              1 1 214 215 0=1 1=1 2=-1
BinaryOp                 mul_110                  1 1 215 216 0=2 1=1 2=1.2
HardSigmoid              hsigmoid_14              1 1 216 217 0=0.166667 1=0.5
Convolution              conv_95                  1 1 180 218 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1152
Split                    splitncnn_9              1 3 218 219 220 221
Pooling                  gap_5                    1 1 221 222 0=1 4=1
Convolution              convrelu_5               1 1 222 223 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              conv_97                  1 1 223 224 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Reshape                  reshape_118              1 1 224 225 0=1 1=1 2=-1
BinaryOp                 mul_111                  1 1 225 226 0=2 1=1 2=1.2
HardSigmoid              hsigmoid_15              1 1 226 227 0=0.166667 1=0.5
Interp                   interpolate_44           1 1 196 228 0=1 1=2.0 2=2.0 6=0
BinaryOp                 mul_112                  2 1 199 207 229 0=2
BinaryOp                 add_113                  2 1 200 229 230 0=0
BinaryOp                 add_114                  2 1 230 228 231 0=0
Split                    splitncnn_10             1 2 231 232 233
Interp                   interpolate_45           1 1 232 234 0=1 1=2.0 2=2.0 6=0
BinaryOp                 mul_115                  2 1 209 217 235 0=2
BinaryOp                 add_116                  2 1 210 235 236 0=0
BinaryOp                 add_117                  2 1 236 234 237 0=0
Split                    splitncnn_11             1 2 237 238 239
Interp                   interpolate_46           1 1 238 240 0=1 1=2.0 2=2.0 6=0
BinaryOp                 mul_118                  2 1 219 227 241 0=2
BinaryOp                 add_119                  2 1 220 241 242 0=0
BinaryOp                 add_120                  2 1 242 240 243 0=0
Convolution              conv_98                  1 1 197 244 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=20736
Split                    splitncnn_12             1 3 244 245 246 247
Pooling                  gap_6                    1 1 247 248 0=1 4=1
Convolution              convrelu_6               1 1 248 249 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144 9=1
Convolution              conv_100                 1 1 249 250 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144
Reshape                  reshape_119              1 1 250 251 0=1 1=1 2=-1
BinaryOp                 mul_121                  1 1 251 252 0=2 1=1 2=1.2
HardSigmoid              hsigmoid_16              1 1 252 253 0=0.166667 1=0.5
BinaryOp                 mul_122                  2 1 245 253 254 0=2
BinaryOp                 add_123                  2 1 246 254 255 0=0
Convolution              conv_101                 1 1 233 256 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=20736
Split                    splitncnn_13             1 3 256 257 258 259
Pooling                  gap_7                    1 1 259 260 0=1 4=1
Convolution              convrelu_7               1 1 260 261 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144 9=1
Convolution              conv_103                 1 1 261 262 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144
Reshape                  reshape_120              1 1 262 263 0=1 1=1 2=-1
BinaryOp                 mul_124                  1 1 263 264 0=2 1=1 2=1.2
HardSigmoid              hsigmoid_17              1 1 264 265 0=0.166667 1=0.5
BinaryOp                 mul_125                  2 1 257 265 266 0=2
BinaryOp                 add_126                  2 1 258 266 267 0=0
Convolution              conv_104                 1 1 239 268 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=20736
Split                    splitncnn_14             1 3 268 269 270 271
Pooling                  gap_8                    1 1 271 272 0=1 4=1
Convolution              convrelu_8               1 1 272 273 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144 9=1
Convolution              conv_106                 1 1 273 274 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144
Reshape                  reshape_121              1 1 274 275 0=1 1=1 2=-1
BinaryOp                 mul_127                  1 1 275 276 0=2 1=1 2=1.2
HardSigmoid              hsigmoid_18              1 1 276 277 0=0.166667 1=0.5
BinaryOp                 mul_128                  2 1 269 277 278 0=2
BinaryOp                 add_129                  2 1 270 278 279 0=0
Convolution              conv_107                 1 1 243 280 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=20736
Split                    splitncnn_15             1 3 280 281 282 283
Pooling                  gap_9                    1 1 283 284 0=1 4=1
Convolution              convrelu_9               1 1 284 285 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144 9=1
Convolution              conv_109                 1 1 285 286 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144
Reshape                  reshape_122              1 1 286 287 0=1 1=1 2=-1
BinaryOp                 mul_130                  1 1 287 288 0=2 1=1 2=1.2
HardSigmoid              hsigmoid_19              1 1 288 289 0=0.166667 1=0.5
BinaryOp                 mul_131                  2 1 281 289 290 0=2
BinaryOp                 add_132                  2 1 282 290 291 0=0
Interp                   interpolate_47           1 1 255 292 0=1 1=8.0 2=8.0 6=0
Interp                   interpolate_48           1 1 267 293 0=1 1=4.0 2=4.0 6=0
Interp                   interpolate_49           1 1 279 294 0=1 1=2.0 2=2.0 6=0
Concat                   cat_0                    4 1 292 293 294 291 295 0=0
Convolution              convrelu_10              1 1 295 296 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Deconvolution            deconvrelu_0             1 1 296 297 0=24 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=2304 9=1
Deconvolution            deconv_112               1 1 297 298 0=1 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=0 6=96
BinaryOp                 add_133                  1 1 298 299 0=0 1=1 2=-0.233349
Sigmoid                  sigmoid_62               1 1 299 output
